# ReleaseConditions Constructor (Boolean) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReleaseConditions Constructor (Boolean)
ReleaseConditions Class See Also
---
Creates a new instance of ReleaseConditions.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ReleaseConditions(
	bool start
)
```

Visual Basic
---
```text
Public Sub New ( _
	start As Boolean _
)
```

Visual C++
---
```text
public:
ReleaseConditions(
	bool start
)
```

# ### Parameters
start
    Type: System..::..Boolean The position on analytical element. True for start, false for end.
# See Also
ReleaseConditions Class
ReleaseConditions Overload
Autodesk.Revit.DB.Structure Namespace